{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Shane Steinert-Threlkeld",
	"language": "en",
	"home_page_url": "https://www.shane.st/",
	"feed_url": "https://www.shane.st/feed/feed.json",
	"description": "Personal website of Shane Steinert-Threlkeld, with information on research and teaching, as well as a blog and trip reports from various outdoor adventures.",
	"author": {
		"name": "Shane Steinert-Threlkeld",
		"url": "https://www.shane.st/"
	},
	"items": [
		{
			"id": "https://www.shane.st/blog/book-reviews/the-uncanny-muse/",
			"url": "https://www.shane.st/blog/book-reviews/the-uncanny-muse/",
			"title": "_The Uncanny Muse_ by David Hadju",
			"content_html": "<p><em>The Uncanny Muse</em>, David Hadju (audio).  This book's subtitle---&quot;Music, Art, and Machines from Automata to AI&quot;---captures its greatest virtue: it provides both an illuminating and entertaining history of the role of machines in the arts as both of them have evolved throughout history (at least since around the 1600s).  Although it does contain many examples of visual art, including a long episode of Andy Warhol and the wider New York art world around the founding of MoMA and various exhibits of machines and art (including machines-as-art), it's also no accident that the subtitle begins with &quot;Music&quot;: Hadju shines as a historian of music, telling of the development of the microphone, the player piano, electric organs, synthesizers, and the (embarassingly unknown-to-me) history of house music.  Hadju's telling of the history flows smoothly and listens easily; corner-stone objects or moments provide for natural, and often unnoticed, transitions between historical episodes.  Tracing this history shows the cyclical nature of a debate that is re-surfacing now: new technologies are often thought to threaten human creativity, but oftentimes become accepted and expand it.  With that being said, two thoughts on Hadju's handling of the present, LLM-driven moment, which felt like the weakest section to me.  On the one hand, he admirably does not directly argue for one view or another, but mostly just presents a history.  On the other hand, his use of ChatGPT to write a few paragraphs about its own history (this explained the eye-rolling phrase that it &quot;perfects its...&quot; TODO: look-up), and repeated emphasis of &quot;the machine condition&quot; in addition to the human condition lead one to believe that the present moment is just the latest instance in this historical cycle.  As I'm sure many people have, I've been having some currently-uncoalesced thoughts about asymmetries between LLM-generation and other machine-assisted art (which I've both produced and been a fan of at different times).  This book hasn't necessarily increased the coalescence of my own thoughts, but has provided rich fodder for them due to the excellent re-telling of some important historical episodes.  Grade: B+</p>\n",
			"date_published": "2025-02-17T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/states-of-adventure/",
			"url": "https://www.shane.st/blog/book-reviews/states-of-adventure/",
			"title": "_States of Adventure_ by Fitz Cahall",
			"content_html": "<p><em>States of Adventure</em>, Fitz Cahall.  This book was a perfect holiday gift for me.  Part coffee-table photo book, part adventure memoir anthology, it contains 30 relatively bit-sized stories distilled from Cahall's podcast <em>The Dirtbag Diaries</em>.  That show is the original outdoor/adventure podcast, and one of the earliest podcasts period.  I'm ashamed to say I've never listened to it (though I've listened to Cahall's other show <em>Climbing Gold</em>, and various interviews with him), so I can't attest to the direct mapping from podcast episode to chapter in this book (though it is clear that they are not transcripts; many are also not written by Cahall, but by others who either lived the adventure or did the primary reporting).  For the most part, the stories were great reading and viewing.  Some were downright moving: a team of strangers banding together to carry a taken-too-soon-by-disease man's boots through the Appalachian Trail so that they at least could fulfill his dream.  (This one felt like an antidote to the isolation that has created some of the larger problems in our world right now.). Some felt like they didn't translate well into written form.  While I'm sure the story of the youngest rafting descent through the Colorado River in the Grand Canyon was riveting, the written word was not: &quot;The river pulled her in.  Each wave formed its own deep canyon.  The kayaks acclerated down the backside of the wave.&quot;  While certainly not nearly AI slop, some writing like this had a certain average-of-all-adventure-writing genericity reminiscent of ChatGPT's &quot;style&quot;.  Some were especially enjoyable because they hit close to home: Fitz Cahall is a fellow Seattleite, almost exactly 10 years my senior, so I especially enjoyed hearing about his transition into family life with a trailer in Crystal Mountain's famous Lot B, skiing down the iconic Brothers in the Olympic mountains, and his evolution as a climber in and through Index.  The book certainly has something for everyone, and I will happily pass it around and tell folks about many of the stories, though with a tongue not quite as silver as Cahall's.  Grade: A-</p>\n",
			"date_published": "2025-02-16T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/cultish/",
			"url": "https://www.shane.st/blog/book-reviews/cultish/",
			"title": "_Cultish: The Language of Fanaticism_ by Amanda Montell",
			"content_html": "<p><em>Cultish: The Language of Fanaticism</em>, Amanda Montell (audio).  I stumbled upon this book just through browsing the Libby app, but thoroughly enjoyed it.  The name comes not just from analyzing cult-like groups, but is intended to evoke English and Spanish, in highlighting how language is used to form and shape groupthink.  Terms that were new to me---but labeling phenomena which are very much noticeable---include &quot;thought-terminating cliché&quot;  (aka &quot;semantic stopsign&quot;) and &quot;love-bombing&quot;.  Although it did include detailed analyses of several typical cults (e.g. Scientology, Jonestown, Heaven's Gate), I especially appreciated the discussion of group fitness trends like CrossFit, SoulCycle, and Bikram yoga.  When I first became serious about physical training (for ultimate, in college), CrossFit was nearing its peak influence; luckily, I was able to extract some useful information while smeleling something a bit fishy in its celebration of suffering and zealousness of its supporters. (I also did a non-trivial number of Bikram classes during grad school.)  The final section covered social media influencers, highlighting a few from the wellness space that were news to me. The book also has a nice pace, with a clear structure, which also lent itself very well to the audio format.  Grade: B+</p>\n",
			"date_published": "2025-02-09T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/on-writing/",
			"url": "https://www.shane.st/blog/book-reviews/on-writing/",
			"title": "_On Writing_ by Stephen King",
			"content_html": "<p><em>On Writing</em>, Stephen King.  This is (ironically?) the first thing I've read by Stephen King.<label for=\"sn-0\" class=\"margin-toggle sidenote-number\"></label><input type=\"checkbox\" id=\"sn-0\" class=\"margin-toggle\"><span class=\"sidenote\">test a sidenote.  If it gets too long, then what happens?</span>  I've owned it for many years, buying it during one of those pangs of doubt near the end of grad school; maybe this would be the book that turned the pangs into a new self-conception.  Needless to say, I'm not sure what prompted me to finally pick up after so long; even after I got tenure.  Oh: probably the book I'm over 18 months late on and the grant application I had to delay as well.  Anyways: great read.  I see why Stephen King has had the success that he has.  The book opened with a memoir section; a rather turbulent and fragmented childhood was mirrored both in the prose (short, punchy sentences) and in the structure (very short numbered sections) in a very satisfying way.  I won't go too much into the details of either his life or his suggestions (I think the four hours a day, every day, line has been repeated enough; and a small few things were a bit too specific to fiction writing), but will mention one other thing that stood out to me: his approach to writing as a craft (of course it is!), and the analogies to other crafts like plumbing.  I remember during grad school reading the introduction to Michael Dummett's <em>A Logical Basis of Metaphysics</em>, as erudite and obscure a book as exists (look at that title!), and being struck by the line, &quot;Philosophy, after all, is a craft, as plumbing is&quot;.  Several similar moments met me in King's book.<span class=\"marginnote\">How about a margin note? And what if I make it really really long?</span>  Great read.  Not the last of his for me.  Grade:  A-</p>\n",
			"date_published": "2025-01-04T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/books-2024/",
			"url": "https://www.shane.st/blog/books-2024/",
			"title": "The Books I Read in 2024",
			"content_html": "<p>Starting in 2020, I began keeping track of all of the books I read, a habit I adapted from my brother.  Starting in 2023, I jotted down a quick long-paragraph review (with a &quot;grade&quot;) of each book as well.  Here's the list of books I read in 2024, in reverse chronological order:</p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/alchemy-of-action/\" class=\"postlist-link\"><em>The Alchemy of Action</em> by Doug Robinson</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-10-01\">October 01, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/climbing\">climbing</a>,   <a href=\"https://www.shane.st/tags/neuroscience\">neuroscience</a>,   <a href=\"https://www.shane.st/tags/psychadelics\">psychadelics</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: B+</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/pizza-in-new-haven/\" class=\"postlist-link\"><em>Pizza in New Haven</em> by Colin M. Caplan</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-09-11\">September 11, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/food\">food</a>,   <a href=\"https://www.shane.st/tags/history\">history</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: C+</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/the-darkest-white/\" class=\"postlist-link\"><em>The Darkest White</em> by Eric Blehm</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-08-20\">August 20, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/mountain-sports\">mountain sports</a>,   <a href=\"https://www.shane.st/tags/avalanche\">avalanche</a>,   <a href=\"https://www.shane.st/tags/snowboarding\">snowboarding</a>,   <a href=\"https://www.shane.st/tags/biography\">biography</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: A</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/clear-thinking/\" class=\"postlist-link\"><em>Clear Thinking</em> by Shane Parrish</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-07-28\">July 28, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/self-help\">self-help</a>,   <a href=\"https://www.shane.st/tags/cognitive-science\">cognitive science</a>,   <a href=\"https://www.shane.st/tags/decision-making\">decision-making</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: C</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/a-brief-history-of-intelligence/\" class=\"postlist-link\"><em>A Brief History of Intelligence</em> by Max Bennett</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-07-07\">July 07, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/science\">science</a>,   <a href=\"https://www.shane.st/tags/artificial-intelligence\">artificial intelligence</a>,   <a href=\"https://www.shane.st/tags/evolution\">evolution</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: A-</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/imagination-a-manifesto/\" class=\"postlist-link\"><em>Imagination: A Manifesto</em> by Ruha Benjamin</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-06-10\">June 10, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/imagination\">imagination</a>,   <a href=\"https://www.shane.st/tags/sociology\">sociology</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: A</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/hidden-life-of-trees/\" class=\"postlist-link\"><em>The Hidden Life of Trees</em> by Peter Wohlleben</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-05-05\">May 05, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/trees\">trees</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: A</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/life-as-we-know-it-can-be/\" class=\"postlist-link\"><em>Life As We Know It (Can Be)</em> by Bill Weir</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-04-12\">April 12, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/climate\">climate</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: B</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/the-art-of-shralpinism/\" class=\"postlist-link\"><em>The Art of Sharlpinism</em> by Jeremey Jones</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-03-16\">March 16, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/skiing\">skiing</a>,   <a href=\"https://www.shane.st/tags/snowboarding\">snowboarding</a>,   <a href=\"https://www.shane.st/tags/sports\">sports</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: B+</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/i-rigoberta-menchu/\" class=\"postlist-link\"><em>I, Rigoberta Menchú</em> by Rigoberta Menchú</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-02-22\">February 22, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/guatemala\">guatemala</a>,   <a href=\"https://www.shane.st/tags/mayan-culture\">mayan culture</a>,   <a href=\"https://www.shane.st/tags/politics\">politics</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: A</span>\n</p><p></p>\n<p></p><p class=\"postlist-item pb-4\">\n<a href=\"https://www.shane.st/blog/book-reviews/eastern-standard-tribe/\" class=\"postlist-link\"><em>Eastern Standard Tribe</em> by Cory Doctorow</a>\n<br>\n<time class=\"postlist-date\" datetime=\"2024-01-12\">January 12, 2024</time>\n<br>\n<span class=\"fs-6\">\nTags:  <a href=\"https://www.shane.st/tags/book-reviews\">book-reviews</a>,   <a href=\"https://www.shane.st/tags/fiction\">fiction</a>,   <a href=\"https://www.shane.st/tags/time\">time</a>,   <a href=\"https://www.shane.st/tags/mental-health\">mental health</a>\n</span>\n<br>\n<span class=\"fs-6\">Grade: B+</span>\n</p><p></p>\n",
			"date_published": "2025-01-03T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/alchemy-of-action/",
			"url": "https://www.shane.st/blog/book-reviews/alchemy-of-action/",
			"title": "_The Alchemy of Action_ by Doug Robinson",
			"content_html": "<p><em>The Alchemy of Action</em>, Doug Robinson.  The main question on the title: &quot;Why do people climb mountains?&quot;  A great question, especially to someone who spends as much of their free time climbing as I (and many of my friends) do.  The answer: &quot;Because it gets us high.&quot;  A more intriguing answer than Sir Edmund Hillary's &quot;Because it's there.&quot;  More concretely, the book argues---suggests, in an appropriately humble way, may be more appropriate---that adventure sports (running, skiing, climbing, etc) can cause the body to produce DMT and/or anandamide (a new-to-me neurotransmitter that binds to the same receptors as THC), which is responsible for feelings of euphoria, heightened perception, and the like in these contexts.  A self-published book about psychadelics certainly runs the risk of becoming too detached from the facts on the ground; and although Robinson's writing style often veers towards Huxley and Hunter S Thompson, it struck me as relatively well-informed and very appropriately scientifically modest: he knows when and is clear to flag when he's speculating and when he's reporting results from the literature.  And this description of various metabolic pathways and the scientific literature is intermixed with some good old-fashioned mountain man memoir writing (Robinson was a pioneer in the golden era of Yosemite climbing and a long-time mountain guide in the Sierras).  Am I fully convinced of the core thesis? No. Do I regret reading the book? Definitely not.  Do I want to follow-up and see what's been discovered on these topics in the 20 years since Robinson wrote this?  Quite possibly.  Grade: B+</p>\n",
			"date_published": "2024-10-01T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/pizza-in-new-haven/",
			"url": "https://www.shane.st/blog/book-reviews/pizza-in-new-haven/",
			"title": "_Pizza in New Haven_ by Colin M. Caplan",
			"content_html": "<p><em>Pizza in New Haven</em>, Colin M. Caplan.  My brother got me this book as a gift several years ago because we grew up 40 minutes away from New Haven and would go somewhat regularly for pizza (has to be Sally's for me).  An upcoming trip to New Haven caused me to finally sit down and read the book.  While Colin Caplan certainly loves New Haven and its pizza history and has done a great service to many people and families in documenting the history of pizza in New Haven---and many photos of old restaurants, people, advertisements, and the like add a lot of context and character---this book leaves much to be desired.  In my day job as a linguistics professor, when discussing pragmatics (language use in context) over semantics (literal meaning), I often joke about how conversation and discourse is much more complex than randomly sampling true sentences and uttering them.  Unfortunately, this book often felt like the latter.  Tons of very detailed facts were sequenced together, but not stitched together into any kind of larger historical arc or story.   This lack of narrative arc also caused the book to lack structure; it was unclear why certain stories were placed where they were, or why certain chapters followed the previous ones. In addition to quite a few typos, there were basic issues that gave the impression the book had not been proof-read; for example, &quot;coke-fired&quot; ovens were discussed from the very beginning, but not explained until page 189.  Several stories were repeated, often just pages apart.  I did still learn a lot, including seeing the impact of Redevelopment (plowing neighborhoods for highways, as in too many US cities) in New Haven, but was certainly left wanting. (I'm somewhat ashamed that this was my first print book of the year, in September.)  Grade: C+</p>\n",
			"date_published": "2024-09-11T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/the-darkest-white/",
			"url": "https://www.shane.st/blog/book-reviews/the-darkest-white/",
			"title": "_The Darkest White_ by Eric Blehm",
			"content_html": "<p><em>The Darkest White</em>, Eric Blehm (audio).  This is the story of Craig Kelly, aptly subtitled &quot;A mountain legend and the avalanche that took him&quot;.  Kelly is someone I'd heard about---<em>the</em> snowboarder's snowboarder---but about whom I didn't know much more, since (i) I ski and (ii) am relatively new to snow sports and so was not conscious of him during his rise and when this tragedy took place (early 2000s).  This book was gripping: a very informative character portrait from Kelly's somewhat troubled early days in Mt. Vernon, WA and a portrait of the birth of a new sport.  He seems like a &quot;real one&quot;: dedicated to his craft, humble in his own success, and loyal to his loved ones.  The story of the avalanche itself (during an apprenticeship for Kelly to become the first snowboard-based mountain guide) is also very detailed and informative.  The epilogue must be read, as it paints a richer portrait of Ruedi Beglinger, the main guide that day, and his role in the affair.  (I suspect it's an epilogue and not in the main text simply because many of the details could not be corroborated and Blehm seems to be a serious journalist.) Ultimately, it's a story both of the pitfalls of interpersonal relationships, mental health, and the true randomness of the mountains.  Grade: A.</p>\n",
			"date_published": "2024-08-20T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/clear-thinking/",
			"url": "https://www.shane.st/blog/book-reviews/clear-thinking/",
			"title": "_Clear Thinking_ by Shane Parrish",
			"content_html": "<p><em>Clear Thinking</em>, Shane Parrish (audio).  I saw this book mentioned on a blog I read and my library had it available immediately as an audiobook (and a relatively short one) right before I set off on an international trip, so I decided to check it out.  Expecting some relatively interesting cognitive science (the purpose of the trip in fact), I instead received pretty standard self-help platitudes about process vs outcome, what you can control, and things of that sort.  (I don't mean to belittle some of the ideas too much, but they were certainly old news to me.  The target demographic seems to be a certain kind of corporate and/or military bro.)  I almost stopped listening entirely when, in a lesson on personal accountability, the author parenthetically added: &quot;Don't blame the bus for being late. Get a car.&quot;  That sentiment so completely misses the point (we should be striving to ween the USA off of its car-dependence and providing reliable public transit, not shaming people who have to rely on an under-funded system).  If it weren't for the amount of time I was spending in airports and on trains, I would have left the book behind.  Grade: C</p>\n",
			"date_published": "2024-07-28T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/a-brief-history-of-intelligence/",
			"url": "https://www.shane.st/blog/book-reviews/a-brief-history-of-intelligence/",
			"title": "_A Brief History of Intelligence_ by Max Bennett",
			"content_html": "<p><em>A Brief History of Intelligence</em>, Max Bennett (audio).  A surprisingly pleasant and informative evolutionary history of our species and, in particular, our cogntivie capacities, centered around five breakthroughs: navigation, reinforcing, simulating, mentalizing, speaking.  For me, personally, the history of navigation and its role in evolution was by far the newest of these, and quite interesting to learn about.  While there were moments when I feared the author would stretch credulity for hype, the summaries of the work that I do know were always surprisingly accurate and appropriately hedged (minus the prediction in the end that the sixth breakthrough will be artificial super intelligence).  Would recommend to friends and colleagues.  Grade: A-</p>\n",
			"date_published": "2024-07-07T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/imagination-a-manifesto/",
			"url": "https://www.shane.st/blog/book-reviews/imagination-a-manifesto/",
			"title": "_Imagination: A Manifesto_ by Ruha Benjamin",
			"content_html": "<p><em>Imagination: A Manifesto</em>, Ruha Benjamin (audio).  I must confess to owning but having never made it through Benjamin's <em>Race After Technology</em>, so I was very excited when this short book came out in audio format.  A wonderful expression of and testament to the power of imagination and of dreaming about other possibilities, including other futures.  The book provides many good examples, and focuses on ways in which societal structures implicitly (and explicitly!) choose what kinds of people are <em>allowed</em> to imagine and to dream.  The last chapter and appendix have some concrete exercises (&quot;making shit up university&quot; for instance) that seem useful and that I can imagine using in class in the future.  Grade: A</p>\n",
			"date_published": "2024-06-10T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/hidden-life-of-trees/",
			"url": "https://www.shane.st/blog/book-reviews/hidden-life-of-trees/",
			"title": "_The Hidden Life of Trees_ by Peter Wohlleben",
			"content_html": "<p><em>The Hidden Life of Trees</em>, Peter Wohlleben (audio).  A wonderful book that explains the ways in which trees communicate, live and die, and even interact socially.  (Amongst many other amazing behaviors, e.g. wound-tending.)  Written by a forest manager, and covering some of the relevant academic literature (e.g. around the role of mycelium networks in aiding communication in root systems), this book felt like a very refreshing &quot;natural history&quot; kind of book: it's largely a narration of what you will see if you look closer and understand trees---and forests, in particular, as the difference between re-planted groves of trees and the richness of natural forests is a recurring theme---on their own terms and, in particular, at their own time-scale.  I certainly won't look at trees the same way after this.  Grade: A</p>\n",
			"date_published": "2024-05-05T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/life-as-we-know-it-can-be/",
			"url": "https://www.shane.st/blog/book-reviews/life-as-we-know-it-can-be/",
			"title": "_Life As We Know It (Can Be)_ by Bill Weir",
			"content_html": "<p><em>Life as We Know It (Can Be)</em>, Bill Weir (audio). This book was an odd mix of (i) interesting anecdotes that are intended to inspire climate optimism and/or a call to action and (ii) personal memoir.  This second component was especially prominent in one of the two recurring leitmotifs throughout the book: writing letters to his young son about what his climate future might look like.  (The other recurring motif was Maslow's hierarchy of needs.  Both felt a bit forced.). While I did learn some things (e.g. about alternative food sources), the book honestly felt too personal to me, especially in the last couple of chapters when it became something of an apology for being a bit absent from his family while traveling the world for his TV shows.  Grade: B</p>\n",
			"date_published": "2024-04-12T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/the-art-of-shralpinism/",
			"url": "https://www.shane.st/blog/book-reviews/the-art-of-shralpinism/",
			"title": "_The Art of Sharlpinism_ by Jeremey Jones",
			"content_html": "<p><em>The Art of Sharlpinism</em>, Jeremey Jones (audio).  I listened to most of this on the way back from an &quot;eat pray ski&quot; trip to Big Sky.  A compendium of &quot;lessons from the mountains&quot;, it's a mix of stories from his and others' lives in the mountains as well as something of a how-to guide in places.  Two things that I'll take away: (1) &quot;love of sport&quot; days skiing/riding, i.e. going out even when it's bad conditions and still learning things and working on your craft; (2) &quot;the church of the seven day recreationalists&quot;: from Jim Zellers (?), three rules: (i) recreate outside every day of the week, (ii) keep your house and life in order, and (iii) don't let (ii) get in the way of (i).  I will say that this book was not ideal for audio format: it has lots of &quot;inserts&quot; and &quot;cut-out&quot; sections which had starts and stops which were occasionally hard to locate.  You also don't get to see the beautiful imagery in the book. Grade: B+.</p>\n",
			"date_published": "2024-03-16T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/i-rigoberta-menchu/",
			"url": "https://www.shane.st/blog/book-reviews/i-rigoberta-menchu/",
			"title": "_I, Rigoberta Menchú_ by Rigoberta Menchú",
			"content_html": "<p><em>I, Rigoberta Menchú</em>, Rigoberta Menchú (audio).  I checked this book out before a trip to Guatemala, but unfortunately only read/listened to it after the trip.  A first-person oral recounting of events (as well as general customs of her community and things like that) in the mid-to-late seventies in Guatemala, from one of the main people involved in organizing many different Mayan populations in response to severe oppression from the government.  Very interesting, and often upsetting (warning: many detailed accounts of torture and things like that), to listen to.  Menchú learned Spanish---the language of the oppressors---in order to be able to tell her story; the linguistic/cultural isolation amongst Mayan communities was also a through-line int he story, and something she worked to overcome.  Very much worth reading or listening to; I would recommend pairing it with a more general history of the same events, since she presupposes some details and is also just telling her story, so not everything is fully situated.  Grade: A</p>\n",
			"date_published": "2024-02-22T00:00:00Z"
		}
		,
		{
			"id": "https://www.shane.st/blog/book-reviews/eastern-standard-tribe/",
			"url": "https://www.shane.st/blog/book-reviews/eastern-standard-tribe/",
			"title": "_Eastern Standard Tribe_ by Cory Doctorow",
			"content_html": "<p><em>Eastern Standard Tribe</em>, Cory Doctorow (audio).  My first time reading (or listening) to fiction by Doctorow, whose nonfiction I've been reading for a long time, mostly via his blog.  Tribes that are oriented around syncing circadian rhythms across borders have formed.  The protagonist Art is a member of Eastern Standard Tribe, but works in London as a UX designer selling intentionally bad designs to undermine that tribe.  The story alternates between his viewpoint in an asylum (told in the first person) and the path that led him there (told in the third person) in an interesting way, and the entire novel ends with the line &quot;you know, you belong in a looney bin&quot;.  I enjoyed this story-telling device, but the book as a whole did not have a super strong impact; possibly because it was written in 2004, and so both it and the future it imagines are slightly dated.  Grade: B+</p>\n",
			"date_published": "2024-01-12T00:00:00Z"
		}
		
	]
}
